Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/jobseekers_allowance_transition.html.txt.tmx
Source language: en
Languages: ga

source: The Jobseeker’s Transitional payment is a special arrangement under the Jobseeker’s Allowance scheme that aims to support lone parents into the workforce while they have young children
ga: Socrú speisialta is ea socrú idirthréimhseach Liúntas Cuardaitheora Poist faoin scéim Liúntas Cuardaitheora Poist a bhfuil de chuspóir aige tacú le tuismitheoirí aonair chun an lucht saothair a iontráil fad a bhíonn leanaí óga acu

source: The payment is known as JST
ga: Tugtar LCPI ar an socrú idirthréimhseach LCP, amanna

source: This payment is available to people who are not cohabiting and whose youngest child is aged between 7 and 13 years inclusive
ga: Tá an íocaíocht seo ar fáil do dhaoine nach bhfuil ag comhchónaí agus a bhfuil a leanbh is óige idir 7 agus 13 bliana d’aois, na haoiseanna siúd san áireamh

source: If you were getting JST and stopped for some reason (for example because you found work or started to cohabit), you can requalify if you still satisfy the conditions of the scheme
ga: Má bhí LCPI á fháil agat agus má stop tú lena fháil ar chúis éigin (mar shampla, má d’aimsigh tú obair nó má chuir tú tús le comhchónaí), féadfaidh tú athcháiliú don LCPI má shásaíonn tú coinníollacha na scéime go fóill

source: If you are no longer entitled to OFP, and your youngest child is aged 14 years or over, you can apply for the normal Jobseeker’s Allowance
ga: Mura bhfuil tú i dteideal íocaíocht ÍTA a thuilleadh, agus má tá do leanbh is óige 14 bliana d’aois nó níos sine, féadfaidh tú iarratas a dhéanamh ar an ngnáthíocaíocht Liúntas Cuardaitheora Poist

source: The rules that apply to Jobseeker’s Allowance (JA) and JST are similar
ga: Tá na rialacha a bhaineann le Liúntas Cuardaitheora Poist (LCP) agus le LCPI an-chosúil lena chéile

source: The maximum weekly rate of payment is the same
ga: Déantar measúnú ar 60% ar aon tuillimh os a chionn sin

source: The main differences between JA and JST are:
ga: Is iad na príomhdhifríochtaí idir LCP agus LCPI:

source: • You do not have to be available for and genuinely seeking full-time work
ga: • Ní gá duit bheith ar fáil le haghaidh oibre agus ní gá go bhfuil fíor-iarrachtaí á ndéanamh agat chun obair lánaimseartha a lorg

source: This is to allow you to meet your caring responsibilities when you have young children
ga: Is amhlaidh atá seo chun ligeann duit d’fhreagrachtaí cúraim a chomhlíonadh nuair a bhíonn leanaí óga agat

source: There are childcare supports available if you do find work
ga: Tá tacaíochtaí cúram leanaí ar fáil mura n-aimsíonn tú obair

source: • You can take part in a course of education and get JST (and, if eligible, a student maintenance grant). However, you should find our whether or not the Back to Education Allowance is a better option for you in our document on social welfare payments and the student grant
ga: • Féadfaidh tú páirt a ghlacadh i gcúrsa oideachais agus LCPI a fháil (agus, má tá tú incháilithe, d’fhéadfá deontas mac léinn a fháil)

source: • You do not have to be fully unemployed for 4 out of 7 days
ga: • Ní gá duit bheith go hiomlán dífhostaithe ar feadh 4 lá as 7 lá

source: This means that you could work part-time for 5 days and still receive a payment (subject to the means test)
ga: Ciallaíonn seo go bhféadfá oibriú go páirtaimseartha ar feadh 5 lá agus leanfá le híocaíocht a fháil fós féin faoi réir na tástála maoine

source: This would allow you to work mornings only while your children are in school
ga: Cheadódh seo duit oibriú ar maidin amháin fad a bhíonn do leanaí ar scoil

source: • You cannot cohabit with another person while you are getting JST
ga: • Ní féidir leat comhchónaí le duine eile fad atá LCPI á fháil agat

source: While you are getting JST you must sign a quarterly declaration to confirm that you are still entitled to JST
ga: Fad atá LCPI á fháil agat, ní mór duit dearbhú ráithiúil a shíniú lena dheimhniú go bhfuil tú fós i dteideal an LCPI a fháil

source: You must always declare any change in your circumstances including a change in your living arrangement or means that might affect your entitlement to JST
ga: Má bhí Liúntas Breosla á fháil agat le do ÍTA, féadfaidh tú seo a choimeád nuair a fhaigheann tú LCPI

source: Conditions for getting JST
ga: Coinníollacha chun LCPI a fháil

source: Income from work is assessed differently for JST (see below)
ga: Ní mór duit an tástáil mhaoine le haghaidh LCP a shásamh

source: To be eligible for JST you must be habitually resident in Ireland, you must not be cohabiting and you must be capable of work
ga: Le bheith incháilithe do LCPI, ní mór go bhfuil gnáthchónaí in Éirinn ort, ní mór nach bhfuil tú ag comhchónaí agus ní mór go bhfuil tú in ann obair a dhéanamh

source: When your youngest child reaches 14 years of age, the normal Jobseeker Allowance conditions will apply to you
ga: Nuair a bhaineann do leanbh is óige 14 bliana d’aois, bainfidh na gnáthchoinníollacha Liúntas Cuardaitheora Poist leat

source: When you start getting a Jobseeker's Transitional payment you will be scheduled to attend a meeting with one of the Department of Social Protection's Case Officers
ga: Ní mór duit páirt a ghlacadh i mbearta gníomhachtaithe fostaíochta fad atá LCPI á fháil agat

source: The purpose of this meeting is to identify and access supports (such as education, training and employment schemes) that will prepare you for full-time employment
ga: Forbróidh d’oifigeach cáis plean forbartha pearsanta leat ina sainaithneofar an t-oideachas, an oiliúint agus na scéimeanna fostaíochta oiriúnacha chun cabhrú leat áit a bhaint amach arís san ionad oibre

source: If you do not participate in this process, you may be paid a reduced rate of JST (a penalty rate) or you may be disqualified from getting your JST payment
ga: Ní mór duit páirt a ghlacadh sna cúrsaí oideachais, oiliúna nó cláir fostaíochta a mholtar

source: You can work and get JST
ga: Socrú idirthréimhseach Liúntas Cuardaitheora Poist i

source: The amount of payment you get depends on your weekly means
ga: 2016 agus roimh 16 Márta 2017

source: If you are self-employed, this income disregard does not apply
ga: │Uasráta pearsanta │Méadú do leanbh cáilithe │

source: You cannot claim a half-rate Carer’s Allowance with JST
ga: Socrú idirthréimhseach Liúntas Cuardaitheora Poist ó

source: │Maximum personal rate │Increase for a qualified child │
ga: │Uasráta pearsanta │Méadú do leanbh cáilithe │

source: If you are getting JST you may qualify for Fuel Allowance (whether you have been getting OFP previously or not)
ga: Má tá LCPI á fháil agat, cáilíonn tú do Liúntas Breosla (cibé acu má bhí nó mura raibh ÍTA á fháil agat roimhe seo)

source: You can claim a Back To School Clothing and Footwear Allowance and Rent Supplement
ga: Féadfaidh tú Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil agus Forlíonadh Cíosa a éileamh

source: You cannot claim Rent Supplement if you are getting a student maintenance grant or if you are in full-time education
ga: Ní féidir leat Forlíonadh Cíosa a éileamh má tá deontas cothabhála mac léinn á fháil agat nó má tá tú in oideachas lánaimseartha

source: You apply for the Jobseeker’s Transitional payment using the JST1 form
ga: Déanann tú iarratas ar shocrú idirthréimhseach Liúntas Cuardaitheora Poist trí fhoirm JST1 a úsáid

source: You can also get an application form from your Intreo Centre or Social Welfare Branch Office
ga: Féadfaidh tú foirm iarratais a fháil, chomh maith, ó d’ionad Intreo nó d’oifig áitiúil leasa shóisialaigh

source: You can get help with filling in your application form at your Intreo Centre, Social Welfare Branch Office or nearest Citizens Information Centre
ga: Féadfaidh tú cabhair a fháil le d’fhoirm iarratais a chomhlánú ó d’ionad Intreo, an oifig áitiúil leasa shóisialaigh nó an tIonad um Fhaisnéis do Shaoránaigh is gaire duit

source: If you think you have been wrongly refused Jobseeker's Transitional payment you can appeal the decision to the Social Welfare Appeals Office
ga: Má cheapann tú gur diúltaíodh Liúntas Cuardaitheora Poist a thabhairt duit go héagórach, féadfaidh tú an cinneadh seo a achomharc leis an Oifig Achomhairc Leasa Shóisialaigh

source: Contact your Intreo Centre or Social Welfare Branch Office
ga: Déan teagmháil le d’oifig leasa shóisialaigh nó d’Ionad Intreo
